Src/CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/cfdemSolverPiso/ErgunTestMPI_restart/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version  2.0;
format   ascii;
class       dictionary;
object      blockMeshDict;
}
// ************************************






   meshGenApp blockMesh;
   convertToMeters 1;

    //64 mm column diameter
    //15 cm length
   
   
   
    //Width of middle square section
   
   
   
   
    //how many cells in the square section
    //how many cells from square section to perimeter
    // how many cells from top to bottom

   vertices
   (
    ( 0.0069 0.0069 0.0  ) // Vertex fiveoclocksqb = 0 
    (-0.0069 0.0069 0.0  ) // Vertex sevenoclocksqb = 1 
    (-0.0069 -0.0069 0.0 ) // Vertex elevenoclocksqb = 2 
    ( 0.0069 -0.0069 0.0 ) // Vertex oneoclocksqb = 3 
   
    ( 0.00975807358913172 0.00975807357161699 0.0 ) // Vertex fiveoclockcb = 4 
    (-0.00975807358913172 0.00975807357161699 0.0) // Vertex sevenoclockcb = 5 
    (-0.00975807358913172 -0.00975807357161699 0.0) // Vertex elevenoclockcb = 6 
    ( 0.00975807358913172 -0.00975807357161699 0.0) // Vertex oneoclockcb = 7 

    ( 0.0069 0.0069 0.0553) // Vertex fiveoclocksqt = 8 
    (-0.0069 0.0069 0.0553) // Vertex sevenoclocksqt = 9 
    (-0.0069 -0.0069 0.0553) // Vertex elevenoclocksqt = 10 
    ( 0.0069 -0.0069 0.0553) // Vertex oneoclocksqt = 11 
   
    ( 0.00975807358913172 0.00975807357161699 0.0553) // Vertex fiveoclockct = 12 
    (-0.00975807358913172 0.00975807357161699 0.0553) // Vertex sevenoclockct = 13 
    (-0.00975807358913172 -0.00975807357161699 0.0553) // Vertex elevenoclockct = 14 
    ( 0.00975807358913172 -0.00975807357161699 0.0553) // Vertex oneoclockct = 15 
   );				

   blocks
   (
    //square block
    hex (
       2 3 0 1   
       10 11 8 9   
       )
    (8 8 24)
    simpleGrading (1 1 1)

    //slice1
    hex (
       1 0 4 5
       9 8 12 13
       )
    (8 4 24)
    simpleGrading (1 1 1)

    //slice2
    hex (
       6 2 1  5 
       14 10 9   13 
       )
   ( 4 8 24)
simpleGrading (1 1 1)

   //slice3
   hex (
         6 7 3 2   
         14 15 11 10   
       )
   (8 4 24)
simpleGrading (1 1 1)

   //slice4
   hex (
         3 7 4 0  
         11 15 12 8  
       )
   (4 8 24)
simpleGrading (1 1 1)

   );


   //create the quarter circles
   edges
   (
    arc 4 5 (0.0 0.0138 0.0 )
    arc 5 6 (-0.0138 0.0 0.0)
    arc 6 7 (0.0 -0.0138 0.0 )
    arc 7 4 (0.0138 0.0 0.0)

    arc 12 13 (0.0 0.0138 0.0553 )
    arc 13 14 (-0.0138 0.0 0.0553 )
    arc 14 15 (0.0 -0.0138 0.0553 )
    arc 15 12 (0.0138 0.0 0.0553 )

   );

   patches
   (
    patch inlet
    (
     (0 3 2 1)
     (0 4 7 3)
     (4 0 1 5)
     (1 2 6 5)
     (3 7 6 2)
    )

    patch outlet
    (
     (8 11 10 9)
     (8 12 15 11)
     (12 8 9 13)
     (9 10 14 13)
     (11 15 14 10)
    )

    wall wall
    (
     (5 4 12 13)
     (5 13 14 6)
     (6 14 15 7)
     (7 15 12 4)
    )

);

mergePatchPairs
(
);
